app/controllers/pages_controller.rb

  def home
    @courses = Course.where(public: true)
---
SELECT "courses".* FROM "courses" WHERE "courses"."public" = ?  [["public", "t"]]